Documents/УправлениеПриборамиУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>УправлениеПриборамиУчета</Name>
			<BasedOn>
				<xr:Item>Catalog.ЛицевыеСчета</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПломбыПриборовУчета</xr:Item>
				<xr:Item>InformationRegister.УстановленныеПриборыУчета</xr:Item>
				<xr:Item>InformationRegister.ПоказанияПриборовУчета</xr:Item>
				<xr:Item>AccumulationRegister.ЗаменыПриборовУчета</xr:Item>
				<xr:Item>InformationRegister.ПоверкиПриборовУчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийУправленияПриборамиУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказатьПломбыПриборовУчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщедомовойСчетчик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПриборыУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВключения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтключения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальноеПоказание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонечноеПоказание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоследнейПоверки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСледующейПоверки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднемесячноеПоказание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПломбы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПломбПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерийныйНомерПломбы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПломбыНовый</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПломбПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерийныйНомерПломбыНовый</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПрибора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоРазмещения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/РасчетПоказанийПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетПоказанийПриборовУчета</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КорректировкаПоказаний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Энергоемкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыРасчетаПоСредней.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыРасчетаПоСредней</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаГод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АналогичныйПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПрошлымМесяцам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаПрошлыйСезон</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УправлениеПриборамиУчета/Forms/ФормаРасчетаСредней/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Если Параметры.Свойство("ДатаДокумента") Тогда
		ДатаДокумента = Параметры.ДатаДокумента;
	КонецЕсли;
	
	Если Параметры.Свойство("ЛицевойСчет") Тогда
		ЛицевойСчет = Параметры.ЛицевойСчет;
	КонецЕсли;
	
	Если Параметры.Свойство("ПриборУчета") Тогда
		ПриборУчета = Параметры.ПриборУчета;
		Услуга = ПриборУчета.Услуга;
		ВидТарифа = Параметры.ВидТарифа;
		ВидРасчетаСреднегоЗначения = Услуга.ВидРасчетаПоСредней;
		Если ВидРасчетаСреднегоЗначения = Перечисления.ВидыРасчетаПоСредней.ПоПрошлымМесяцам тогда
			КоличествоМесяцев = Услуга.БазаДляРасчетаПоСредней;
		КонецЕсли;
	КонецЕсли;
	
	Текст = Нстр("ru = 'Расчет среднемесячного потребления ведется '; uk = 'Розрахунок середньомісячного споживання ведеться '") + НРег(ВидРасчетаСреднегоЗначения);
	
	Элементы.ОписаниеВидаРасчета.Заголовок = Текст;
	
	ПолучитьСтруктуруДляРасчета();
	
	ТаблицаРасчета = ЗаполнитьФормулуНаСервере();
		
	Для Каждого Строка из ТаблицаРасчета Цикл
		НоваяСтрока = ДанныеДляРасчета.Добавить();
		НоваяСтрока.Период = Строка.период;
		НоваяСтрока.Сумма = Строка.Сумма;
	КонецЦикла;
	
	Если ДанныеДляРасчета.Количество() > 0 Тогда
	
		КоличествоМесяцев = ДанныеДляРасчета.Количество();
		СуммаДляРасчета = ДанныеДляРасчета.Итог("Сумма");
		
		ФормулаРасчета =  Строка(СуммаДляРасчета) + "/" + Строка(КоличествоМесяцев);
		
		СреденееПоказание = СуммаДляРасчета/КоличествоМесяцев;
	Иначе
		
		ФормулаРасчета =  НСтр("ru = 'Данные для расчета отсутствуют. Введите среднемесячное показание вручную.'; uk = 'Дані для розрахунку відсутні. Введіть середньомісячне свідчення вручну.'");
	КонецЕсли;
	
	
	
	
КонецПроцедуры

&НаСервере
Процедура  ПолучитьСтруктуруДляРасчета()

	Если НЕ ЗначениеЗаполнено(ВидРасчетаСреднегоЗначения ) Тогда
		Элементы.ОписаниеВидаРасчета.Заголовок = НСТР("ru = 'Для услуги не выбран метод расчета по средней'; uk = 'Для послуги не вибраний метод розрахунку по середній'")+ СТРОКА(Услуга.Наименование);
		Элементы.ОписаниеВидаРасчета.ЦветТекста =  Новый Цвет(255, 0, 0);
		НачалоПериодаРасчета = Дата(1,1,1);
		КонецПериодаРасчета = Дата(1,1,1);
		Возврат;
	КонецЕсли;
	
	
	Если ВидРасчетаСреднегоЗначения = Перечисления.ВидыРасчетаПоСредней.ПоПрошлымМесяцам Тогда
		Если НЕ ЗначениеЗаполнено(КоличествоМесяцев) Тогда
			
			Элементы.ОписаниеВидаРасчета.Заголовок = НСТР("ru = 'Не установлено количество месяцев для расчета среднемесячного потребления для услуги'; uk = 'Не встановлено кількість місяців для розрахунку середньомісячного споживання'")+ СТРОКА(Услуга.Наименование);
			Элементы.ОписаниеВидаРасчета.ЦветТекста =  Новый Цвет(255, 0, 0);
			
		Иначе
			
			НачалоПериодаРасчета = НачалоМесяца(ДобавитьМесяц(ДатаДокумента,-КоличествоМесяцев));
			КонецПериодаРасчета = НачалоМесяца(ДатаДокумента);
			
		КонецЕсли;                
	ИначеЕсли ВидРасчетаСреднегоЗначения = Перечисления.ВидыРасчетаПоСредней.ЗаГод Тогда
		
		НачалоПериодаРасчета = ДобавитьМесяц(ДатаДокумента,(-12));
		КонецПериодаРасчета = НачалоМесяца(ДатаДокумента);
		
	ИначеЕсли ВидРасчетаСреднегоЗначения = Перечисления.ВидыРасчетаПоСредней.ЗаПрошлыйСезон Тогда
		
		Если ЗначениеЗаполнено(Услуга.КонецСезона) и ЗначениеЗаполнено(Услуга.НачалоСезона) Тогда		
			МесяцНачалоПериодаРасчета = Месяц(Услуга.НачалоСезона);
			МесяцКонецПериодаРасчета = Месяц(Услуга.КонецСезона);
			МесяцДокумента = Месяц(ДатаДокумента);
			
			Если МесяцКонецПериодаРасчета > МесяцДокумента Тогда
				ГодКонцаСезона = Год(ДатаДокумента);
			Иначе
				ГодКонцаСезона = Год(ДатаДокумента)-1;
			КонецЕсли;	
			
			Если МесяцКонецПериодаРасчета > МесяцНачалоПериодаРасчета Тогда
				ГодНачалаСезона = ГодКонцаСезона;
			Иначе
				ГодНачалаСезона = ГодКонцаСезона-1;
			КонецЕсли;
			
			НачалоПериодаРасчета = НачалоМесяца(Дата(ГодНачалаСезона,МесяцНачалоПериодаРасчета,1,0,0,0));
			КонецПериодаРасчета = КонецМесяца(Дата(ГодКонцаСезона,МесяцКонецПериодаРасчета,1,0,0,0));
		Иначе
			Элементы.ОписаниеВидаРасчета.Заголовок = НСТР("ru = 'Не установлены начало и конец сезона для расчета среднемесячного потребления для услуги'; uk = 'Не встановлено початок і кінець сезону для розрахунку середньомісячного споживання'")+ СТРОКА(Услуга.Наименование);
			Элементы.ОписаниеВидаРасчета.ЦветТекста =  Новый Цвет(255, 0, 0);
		КонецЕсли;
	ИначеЕсли   ВидРасчетаСреднегоЗначения = Перечисления.ВидыРасчетаПоСредней.АналогичныйПериод Тогда
		ГодПериодаРасчета  = Год(ДатаДокумента)-1;
		МесяцПериодаРасчета = Месяц(ДатаДокумента);
		
		НачалоПериодаРасчета = НачалоМесяца(Дата(ГодПериодаРасчета,МесяцПериодаРасчета,1,0,0,0));
		КонецПериодаРасчета = КонецМесяца(Дата(ГодПериодаРасчета,МесяцПериодаРасчета,1,0,0,0));

		
	КонецЕсли;	
		
		
		
		
КонецПроцедуры // СтруктураДляРасчета()


&НаСервере
Функция ЗаполнитьФормулуНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасчетПоказанийПриборовУчета.Период КАК Период,
	               |	СУММА(ЕСТЬNULL(РасчетПоказанийПриборовУчета.Значение, 0)) КАК Сумма
	               |ИЗ
	               |	РегистрНакопления.РасчетПоказанийПриборовУчета КАК РасчетПоказанийПриборовУчета
	               |ГДЕ
	               |	РасчетПоказанийПриборовУчета.Период МЕЖДУ &НачалоРасчета И &КонецРасчета
	               |	И РасчетПоказанийПриборовУчета.ПриборУчета = &ПриборУчета
	               |	И РасчетПоказанийПриборовУчета.Услуга = &Услуга
	               |	И РасчетПоказанийПриборовУчета.ОбъектУстановки = &ОбъектУстановки
	               |	И РасчетПоказанийПриборовУчета.ВидТарифа = &ВидТарифа
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасчетПоказанийПриборовУчета.Период
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период";
	Запрос.УстановитьПараметр("НачалоРасчета",НачалоПериодаРасчета);
	Запрос.УстановитьПараметр("КонецРасчета",КонецПериодаРасчета);
	Запрос.УстановитьПараметр("Услуга",Услуга);
	Запрос.УстановитьПараметр("ОбъектУстановки",ЛицевойСчет);
	Запрос.УстановитьПараметр("ПриборУчета",ПриборУчета);
	Запрос.УстановитьПараметр("ВидТарифа",ВидТарифа);
	
	результат = Запрос.Выполнить().Выгрузить();
	
	Возврат результат;
	
КонецФункции


&НаКлиенте
Процедура Ок(Команда)
	
	Закрыть(ЗаписатьВоВременноеХранилище(СреденееПоказание));
КонецПроцедуры


&НаСервере
Функция ЗаписатьВоВременноеХранилище(Среденемесячное)

	 Возврат ПоместитьВоВременноеХранилище(Среденемесячное);

КонецФункции // ЗаписатьВоВременноеХранилище()

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()

	Если НЕ ЗначениеЗаполнено(Услуга.ВидРасчетаПоСредней) Тогда
		Элементы.ОписаниеВидаРасчета.Видимость = Ложь;
	Иначе
		Элементы.ОписаниеВидаРасчета.Видимость = Истина;
	КонецЕсли;	
		

КонецПроцедуры // УстановитьВидимостьДоступность()
